/*
ห้เขียนโปรแกรมภาษา C++ เพื่อรับจำนวนเต็มบวกจำนวนหนึ่ง แล้วหาว่าจะต้องใช้กี่ขั้นตอนเพื่อจะลดจำนวนดังกล่าวให้เหลือศูนย์

โดยมีกฎการลดจำนวนในแต่ละขั้นตอนคือ ถ้าจำนวนดังกล่าวเป็นจำนวนคู่ ให้หารจำนวนดังกล่าวด้วย 2 แต่ถ้าไม่ใช่จำนวนคู่ให้หักออก 1 จากจำนวนดังกล่าว

ตัวอย่างข้อมูลเข้า/ข้อมูลออก
    14
    6
อธิบาย
    • 14 เป็นจำนวนคู่ ให้หารด้วย 2 เหลือ 7
    • 7 เป็นจำนวนคี่ ให้หักออก 1 เหลือ 6
    • 6 เป็นจำนวนคู่ ให้หารด้วย 2 เหลือ 3
    • 3 เป็นจำนวนคี่ ให้หักออก 1 เหลือ 2
    • 2 เป็นจำนวนคู่ ให้หารด้วย 2 เหลือ 1
    • 1 เป็นจำนวนคี่ ให้หักออก 1 เหลือ 0 สิ้นสุดการทำงาน ใช้ทั้งหมด 6 ขั้นตอน
*/

#include <iostream>
using namespace std;

int main() {
    int n, cal, i;
    cin >> n;
    cal = n;
    
    for (i = 0; cal > 0; i++) {
        if (cal % 2 == 0) {
            cal /= 2;
        } else {
            cal -= 1;
        }
    }

    cout << i << "\n";
}