/*
ให้เขียนโปรแกรมภาษา C++ เพื่อคำนวณเงินได้รายปีของพนักงานขายสินค้าคนหนึ่ง
โดยมีบันทึกข้อมูลของเงินเดือน และมูลค่าสินค้าที่พนักงานขายได้ในแต่ละเดือน
ระหว่างปีนี้ ไม่มีการขึ้นเงินเดือน และพนักงานขายจะได้เงินได้เพิ่มขึ้นอีก 15% จากมูลค่าสินค้าที่ขายได้ในแต่ละเดือน

ข้อมูลเข้า
บรรทัดแรก เป็นชื่อของพนักงาน
บรรทัดที่สอง เป็นเงินเดือนของพนักงาน (ทศนิยม 2 ตำแหน่ง)
อีก 12 บรรทัดต่อมา เป็นมูลค่าสินค้าที่พนักงานขายได้ในแต่ละเดือนใน 1 ปี
ข้อมูลออก
บรรทัดเดียว แสดงชื่อของพนักงาน และรายได้ทั้งปีของพนักงาน (ทศนิยม 2 ตำแหน่ง โดยใช้ sprintf) คั่นด้วยช่องว่าง

ตัวอย่างข้อมูลเข้า/ข้อมูลออก 1                 ตัวอย่างข้อมูลเข้า/ข้อมูลออก 2
    Peter                                   Wisdom
    12500.00                                13090.00
    10000.00                                2112.00
    10000.00                                14325.00
    10000.00                                8712.00
    10000.00                                6344.00
    10000.00                                11437.00
    10000.00                                12312.50
    10000.00                                9488.25
    10000.00                                21000.00
    10000.00                                16290.00
    10000.00                                15800.00
    10000.00                                10033.00
    10000.00                                8547.00
    Peter 168000.00                         Wisdom 177540.11
*/

#include <iostream>
#include <stdio.h>
using namespace std;

int main() {
    char employee_name[50], buffer[100];
    int i;
    float salary, sales, bonus = 0;

    cin >> employee_name;
    cin >> salary;

    for (i = 0; i < 12; i++) {
        cin >> sales;
        bonus += (sales * 15) / 100;
    }
    sprintf(buffer, "%s %.2f", employee_name, (salary*i) + bonus);

    cout << buffer;
    return 0;
}